import { Matrix, editRows } from '../lib';

// NPC-коты чумного города, 16x16, по 2 кадра idle.
// Индексы = NPC_FRAMES в src/config/gameData.ts.

// Кузнец: коренастый рыжий кот в фартуке, с молотом
const smithIdle1: Matrix = [
  '................',
  '................',
  '...o..o.........',
  '...oooo.....b...',
  '..oooooo....b...',
  '..owoowo....b...',
  '..oooooo...33...',
  '...oooo....33...',
  '..oo11oo........',
  '.oo1111oo.......',
  '.oo1111oo.......',
  '.oo1111oo.......',
  '..o1111o........',
  '..oo..oo........',
  '..oo..oo........',
  '..11..11........',
];
const smithIdle2: Matrix = editRows(smithIdle1, {
  3: '...oooo.........',
  4: '..oooooo..b.....',
  5: '..owoowo..b.....',
  6: '..oooooo..33....',
  7: '...oooo...33....',
});

// Квартирмейстер: серый кот в кирасе с алым плюмажем
const quartIdle1: Matrix = [
  '................',
  '......r.........',
  '...3..r3........',
  '...3333.........',
  '..333333........',
  '..3w33w3........',
  '..333333........',
  '...3333.........',
  '..333333........',
  '.33f33f33.......',
  '.33333333.......',
  '.33f33f33.......',
  '..333333........',
  '..33..33........',
  '..33..33........',
  '..22..22........',
];
const quartIdle2: Matrix = editRows(quartIdle1, {
  1: '................',
  2: '...3.rr3........',
});

// Торговец: кот в капюшоне глубокого синего с тюком
const merchIdle1: Matrix = [
  '................',
  '................',
  '....uuu.........',
  '...uuuuu....bb..',
  '...uuuuu...bbbb.',
  '...uwuwu...bbbb.',
  '...uuuuu...bbbb.',
  '....uuu....bbbb.',
  '...uuuuu....bb..',
  '..uuuuuuu.......',
  '..uuuuuuu.......',
  '..uuyuuuu.......',
  '..uuuuuuu.......',
  '..uu...uu.......',
  '..uu...uu.......',
  '..00...00.......',
];
const merchIdle2: Matrix = editRows(merchIdle1, {
  11: '..uuuuyuu.......',
});

export const npcFrames: Matrix[] = [
  smithIdle1, smithIdle2, //  0-1 кузнец
  quartIdle1, quartIdle2, //  2-3 квартирмейстер
  merchIdle1, merchIdle2, //  4-5 торговец
];
